// 字符串
//  ""  ''
//  ``

// let res = "嘿嘿";

// let res1 = `大家好，我是${res}`

// console.log(res1)

// ES6 方法
// 1、String.includes(要查询的参数)  包含返回true  不包含 返回false   *****
// let str = "123456";
// let res = str.includes("a")
// console.log(res)
// 2、String.repeat(次数)  返回重复次数的字符串
// let str1 = "abc"
// let res = str1.repeat(5)
// console.log(res)
// 3、补全字符串
// String.padStart(长度,拼接的字符串)  头部拼接
// String.padEnd(长度,拼接的字符串)  尾部拼接
// let str = "x";
// let res = str.padEnd(5,"ab");
// console.log(res)


// console.log(0o110  === 72)
// 110 二进制


// let a = 65349654163541635416123123123123123123123123354165341123123123123123111111111111111111111111111111111111111111111111111111111111111231655555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555511111111111111111111111111111111111111111111111111653419653412312312312312312312312312312312312312312312319653416354
// console.log(a)
// let res = Number.isFinite()
// console.log(res)


